//by name 2021.5.28
//qq 3468713544 
//刺杀任务
#include <ansi.h>
inherit F_CLEAN_UP;
int main(object me,string arg)
{
mapping msg=([
"😊" : "微笑",
"😂" : "哭笑",
"🤣" : "笑哭",
"😭" : "哭了",
"🤔" : "思考",
"️🥰" : "喜欢",
"😍" : "爱你",
"😚" : "嘟嘴",
"😝" : "吐舌",
"😔" : "抑郁",
"😁" : "大笑",
"🤗" : "你好",
"🤐" : "闭嘴",
"😠" : "生气",
"😱" : "惊吓",
"😪" : "睡觉",
"😅" : "尴尬",
"😇" : "天使",
"🤮" : "吐了",
"😤" : "生气",
"🧐" : "研究",
"🤡" : "小丑",
"🥵" : "真热",
"🥶" : "真冷",
"💀" : "骷髅",
"💩" : "粑粑",
"👍" : "点赞",
"🐂" : "小牛",
"🐴" : "小马",
"💣" : "炸弹",
"💉" : "针筒",
"🔫" : "水枪",
]);
string text,bq;
text=ZJOBLONG+"目前游戏内表情"ZJBR"可以使用输入法自带的任意表情\n";
text+=ZJOBACTS2+ZJMENUF(4,4,10,31);
foreach(bq in keys(msg)){
text+=bq+"["+msg[bq]+"]:chat "+bq+ZJSEP;
}
write(text+"\n");
return 1;
}
/*
BY：NAME
QQ：3468713544
DATE：2 0 2 2 . 0 2 . 0 3
*/
